lkolbly/cmsis-svd/data/TexasInstruments/LM3S618.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER0</name>
      <description>Register map for TIMER0 peripheral</description>
      <groupName>TIMER</groupName>
      <prependToName>TIMER0</prependToName>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFG</name>
          <description>GPTM Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>TIMER_CFG</name>
              <description>GPTM Configuration</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CFG_32_BIT_TIMER</name>
                  <description>32-bit timer configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CFG_32_BIT_RTC</name>
                  <description>32-bit real-time clock (RTC) counter configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CFG_16_BIT</name>
                  <description>16-bit timer configuration. The function is controlled by bits 1:0 of GPTMTAMR and GPTMTBMR</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMR</name>
          <description>GPTM Timer A Mode</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAMR_TAMR</name>
              <description>GPTM Timer A Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_CAP</name>
                  <description>Capture mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_TAMR_TACMR</name>
              <description>GPTM Timer A Capture Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TAAMS</name>
              <description>GPTM Timer A Alternate Mode Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBMR</name>
          <description>GPTM Timer B Mode</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBMR_TBMR</name>
              <description>GPTM Timer B Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_CAP</name>
                  <description>Capture mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_TBMR_TBCMR</name>
              <description>GPTM Timer B Capture Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBAMS</name>
              <description>GPTM Timer B Alternate Mode Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>GPTM Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>TIMER_CTL_TAEN</name>
              <description>GPTM Timer A Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TASTALL</name>
              <description>GPTM Timer A Stall Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TAEVENT</name>
              <description>GPTM Timer A Event Mode</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_POS</name>
                  <description>Positive edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_NEG</name>
                  <description>Negative edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_BOTH</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_CTL_RTCEN</name>
              <description>GPTM RTC Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TAOTE</name>
              <description>GPTM Timer A Output Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TAPWML</name>
              <description>GPTM Timer A PWM Output Level</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBEN</name>
              <description>GPTM Timer B Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBSTALL</name>
              <description>GPTM Timer B Stall Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBEVENT</name>
              <description>GPTM Timer B Event Mode</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_POS</name>
                  <description>Positive edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_NEG</name>
                  <description>Negative edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_BOTH</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_CTL_TBOTE</name>
              <description>GPTM Timer B Output Trigger Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBPWML</name>
              <description>GPTM Timer B PWM Output Level</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>GPTM Interrupt Mask</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>TIMER_IMR_TATOIM</name>
              <description>GPTM Timer A Time-Out Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CAMIM</name>
              <description>GPTM Capture A Match Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CAEIM</name>
              <description>GPTM Capture A Event Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_RTCIM</name>
              <description>GPTM RTC Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_TBTOIM</name>
              <description>GPTM Timer B Time-Out Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CBMIM</name>
              <description>GPTM Capture B Match Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CBEIM</name>
              <description>GPTM Capture B Event Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>GPTM Raw Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>TIMER_RIS_TATORIS</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CAMRIS</name>
              <description>GPTM Capture A Match Raw Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CAERIS</name>
              <description>GPTM Capture A Event Raw Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_RTCRIS</name>
              <description>GPTM RTC Raw Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_TBTORIS</name>
              <description>GPTM Timer B Time-Out Raw Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CBMRIS</name>
              <description>GPTM Capture B Match Raw Interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CBERIS</name>
              <description>GPTM Capture B Event Raw Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>GPTM Masked Interrupt Status</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>TIMER_MIS_TATOMIS</name>
              <description>GPTM Timer A Time-Out Masked Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CAMMIS</name>
              <description>GPTM Capture A Match Masked Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CAEMIS</name>
              <description>GPTM Capture A Event Masked Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_RTCMIS</name>
              <description>GPTM RTC Masked Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_TBTOMIS</name>
              <description>GPTM Timer B Time-Out Masked Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CBMMIS</name>
              <description>GPTM Capture B Match Masked Interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CBEMIS</name>
              <description>GPTM Capture B Event Masked Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>GPTM Interrupt Clear</description>
          <addressOffset>0x00000024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TIMER_ICR_TATOCINT</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CAMCINT</name>
              <description>GPTM Capture A Match Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CAECINT</name>
              <description>GPTM Capture A Event Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_RTCCINT</name>
              <description>GPTM RTC Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TBTOCINT</name>
              <description>GPTM Timer B Time-Out Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CBMCINT</name>
              <description>GPTM Capture B Match Interrupt Clear</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CBECINT</name>
              <description>GPTM Capture B Event Interrupt Clear</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAILR</name>
          <description>GPTM Timer A Interval Load</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAILR_TAILRL</name>
              <description>GPTM Timer A Interval Load Register Low</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TAILR_TAILRH</name>
              <description>GPTM Timer A Interval Load Register High</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBILR</name>
          <description>GPTM Timer B Interval Load</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBILR_TBILRL</name>
              <description>GPTM Timer B Interval Load Register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMATCHR</name>
          <description>GPTM Timer A Match</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAMATCHR_TAMRL</name>
              <description>GPTM Timer A Match Register Low</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMATCHR_TAMRH</name>
              <description>GPTM Timer A Match Register High</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBMATCHR</name>
          <description>GPTM Timer B Match</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBMATCHR_TBMRL</name>
              <description>GPTM Timer B Match Register Low</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPR</name>
          <description>GPTM Timer A Prescale</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPR_TAPSR</name>
              <description>GPTM Timer A Prescale</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPR</name>
          <description>GPTM Timer B Prescale</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPR_TBPSR</name>
              <description>GPTM Timer B Prescale</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPMR</name>
          <description>GPTM TimerA Prescale Match</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPMR_TAPSMR</name>
              <description>GPTM TimerA Prescale Match</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPMR</name>
          <description>GPTM TimerB Prescale Match</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPMR_TBPSMR</name>
              <description>GPTM TimerB Prescale Match</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <description>GPTM Timer A</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAR_TARL</name>
              <description>GPTM Timer A Register Low</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TAR_TARH</name>
              <description>GPTM Timer A Register High</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBR</name>
          <description>GPTM Timer B</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBR_TBRL</name>
              <description>GPTM Timer B</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
